app/controllers/static_pages_controller.rb

  def home
    @useragents = Useragent.all
    @result = request.user_agent
    @useragent = Useragent.new(agent: @result, counter: 0)

    respond_to do |format|
      if @useragent.save
        format.html { redirect_to root_url }
        format.js
      elsif @existing_agent = Useragent.find_by(agent: @result)
        format.html { Useragent.increment_counter(:counter, @existing_agent.id, touch: true) }
---
SELECT  "useragents".* FROM "useragents" WHERE "useragents"."agent" = ? ORDER BY "useragents"."created_at" DESC LIMIT ?  [["agent", "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_12_5) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/65.0.3325.162 Safari/537.36"], ["LIMIT", 1]]
INSERT INTO "useragents" ("agent", "counter", "created_at", "updated_at") VALUES (?, ?, ?, ?)
UPDATE "useragents" SET "counter" = COALESCE("counter", 0) + 1, "updated_at" = '2018-03-24 04:41:15.608566' WHERE "useragents"."id" = ?  [["id", 1]]